Revit 2027 API
AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDiagramSettings(
	AnalysisDisplayDiagramSettings other
)
Public Sub New (
	other As AnalysisDisplayDiagramSettings
)
public:
AnalysisDisplayDiagramSettings(
	AnalysisDisplayDiagramSettings^ other
)
new :
        other : AnalysisDisplayDiagramSettings -> AnalysisDisplayDiagramSettings
Parameters
other AnalysisDisplayDiagramSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayDiagramSettings Class
AnalysisDisplayDiagramSettings Overload
Autodesk.Revit.DB.Analysis Namespace